PC Client/Catalogs/Абонементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Абонементы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заморозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЗаморозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

PC Client/Catalogs/Абонементы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьРеквизитСправочникаПоСсылке(Ссылка, РеквизитСтрокой, Справочник)
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ
							|	%2.%1 КАК Искомое
							|ИЗ
							|	Справочник.%2 КАК %2
							|ГДЕ
							|	%2.Ссылка = &Ссылка", РеквизитСтрокой, Справочник);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); 
	Возврат Выборка.Искомое			
КонецФункции

&НаКлиенте
Процедура РассчитатьДатуОкончания()
	СекундВДне = 60 * 60 * 24;
	ДатаДляРасчетов = Объект.ДатаАктивации;
	Для сч = 1 По Объект.СрокДействия Цикл
		КоличествоДнейВМесяце = День(КонецМесяца(ДатаДляРасчетов));
		ДатаДляРасчетов = ДатаДляРасчетов + КоличествоДнейВМесяце * СекундВДне;
	КонецЦикла;
	Объект.ДатаОкончания = ДатаДляРасчетов + (Объект.Заморозки.Итог("ДнейЗаморозки") * СекундВДне);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОстатокЗаморозки()
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьЗаморозки(СтрокаТЧ)
	СекундВДне = 60 * 60 * 24;
	НачалоЗаморозки = СтрокаТЧ.ДатаНачала;
	ОкончаниеЗаморозки = СтрокаТЧ.ДатаОкончания;
	ОстатокЗаморозки = Объект.ОстатокДнейЗаморозки;  
	ДлительностьЗаморозкиДней = (ОкончаниеЗаморозки - НачалоЗаморозки) / СекундВДне;

	Если ДлительностьЗаморозкиДней >= ОстатокЗаморозки Тогда
		СтрокаТЧ.ДнейЗаморозки = ОстатокЗаморозки;
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + ОстатокЗаморозки * СекундВДне;
	Иначе
		СтрокаТЧ.ДнейЗаморозки = (ОкончаниеЗаморозки - НачалоЗаморозки) / СекундВДне;
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + ДлительностьЗаморозкиДней * СекундВДне;  
	КонецЕсли;
	РассчитатьОстатокЗаморозки();
	РассчитатьДатуОкончания();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Владелец = ПолучитьРеквизитСправочникаПоСсылке(Объект.Владелец, "Наименование", "Контрагенты");
	Номенклатура = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "Наименование", "Номенклатура");
	Объект.Наименование = Владелец + " (" + Номенклатура + ")";
	Объект.СрокДействия = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "СрокДействияАбонемента", "Номенклатура");
	Объект.ДнейЗаморозки = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "ДнейЗаморозки", "Номенклатура");
	РассчитатьДатуОкончания();
	РассчитатьОстатокЗаморозки();
КонецПроцедуры

&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)
	РассчитатьОстатокЗаморозки();
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	РассчитатьДатуОкончания();
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	РассчитатьОстатокЗаморозки();
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;	
	РассчитатьДлительностьЗаморозки(СтрокаТЧ);
КонецПроцедуры
